package DataType;


//클래스, class > 전체 클래스의 머리통이 public~, 몸통은 그외 전부
//	- 코드의 집합 + 식별자
// 	- 'eclipse_basic' 클래스 
public class eclipse_basic { //헤더(Header) = 선언부
							 //{} : 본문(Body) = 구현부

		
		//1. 주석
		// = Comment
		// = Remark
		
		// 안녕하십니까. 자바를 공부합시다.
		
		// - 컴파일러가 이 부분은 번역하지 않는다.
		// - 개발자를 위한 영역
		// - 프로그래밍 코드x, but 코드에 추가로 무언가를 설명할때 사용함
		// - 코드 설명, 잠시 실행하지 않을 코드, 나중에 확인 등..
		

		//1-1. 주석의 종류
		
		//1) 단일 라인 주석, Single Line Comment
		//2) 다중 라인 주석, Multi Line Comment
		
		//예시:
		// 이것은 단일 라인 주석입니다.
		
		/*
		 * 이것은
		 * 다중
		 * 라인
		 * 주석
		 * 입니다.
		 * 
		 */
		
		
		//1-2. 주석 다는 방법
		
		/*
		 1. 직접 작성
		 2. 단축키 이용
		 
		 	- 단일 라인 주석 : Ctrl + / 
		 	- 다중 라인 주석 : Ctrl + Shift + / (라인 설정)
		 					Ctrl + Shift + \ (라인 해제)
		 
		 */
		
	public static void main(String[] args) {
		
		//메소드 ( = method)
		//	- 코드의 집합 + 식별자
		//	- 'main 메소드'
		
		
		//예시입니다.
		//오후에 결재받을 것
		//System.out.println("주석 이용의 예시");
		
		
		//2. 문자
		
		/*
		 - () : 소괄호
	     - {} : 중괄호 
	     - [] : 대괄호
	     - <> : 화살표 괄호
	     - 한글, 영어
	      !, @, #, $, %, ^, &, *, ~, +, -, ,, ., /, \, |, `(역따옴표, 백틱),',"
	      ;,:
		 
		 */
		
		
		
	}//main
	
	
}
